---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.TextTypeId
source: html/579f8e27-2830-55ea-93d7-14598f234b9f.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.TextTypeId Property

Element id of text associated with the settings.

## Syntax (C#)
```csharp
public ElementId TextTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null